Enums/СтатусыДоставкиSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыДоставкиSMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлялось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетИдентификатора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДоставкиSMS/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращают статусы, для которых требуется запрос обновления у провайдера SMS.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция СтатусыТребующиеОбновления() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Передано);
	Статусы.Добавить(НеОтправлялось);
	Статусы.Добавить(Отправляется);
	Статусы.Добавить(Отправлено);
	
	Возврат Статусы;
	
КонецФункции

// Получает статус доставки SMS из строки.
//
// Параметры:
//  Строка - Строка - Строка статуса доставки.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыДоставкиSMS - Статус.
//
Функция ПолучитьИзСтроки(Строка) Экспорт
	
	Статус = Неопределено;
	
	Если Строка = "НеОтправлялось" Тогда
		Статус = НеОтправлялось;
	ИначеЕсли Строка = "Отправляется" Тогда
		Статус = Отправляется;
	ИначеЕсли Строка = "Отправлено" Тогда
		Статус = Отправлено;
	ИначеЕсли Строка = "НеОтправлено" Тогда
		Статус = НеОтправлено;
	ИначеЕсли Строка = "Доставлено" Тогда
		Статус = Доставлено;
	ИначеЕсли Строка = "НеДоставлено" Тогда
		Статус = НеДоставлено;
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти

#КонецЕсли
